[
  {
    "id": "1lyq6l0",
    "title": "Any men here did a major career change in their mid-30s?",
    "selftext": "If so, from what career field to what new one? Was it difficult? Why did you do it?",
    "url": "https://www.reddit.com/r/AskMenOver30/comments/1lyq6l0/any_men_here_did_a_major_career_change_in_their/",
    "created_utc": 1752404866.0,
    "author": "Winter_Berry_132",
    "subreddit": "AskMenOver30"
  },
  {
    "id": "1lzkqc8",
    "title": "Fear of injury keeping me from exercising.",
    "selftext": "My son recently bought a rogue fitness rack with barbell and weights( he wrestles) and is considering an echo bike as well.\n\nI'm mid 40's with low testosterone and obese. I don't want to take supplements or shots for weight loss or anything else.\n\nI would rather start lifting weights and cardio but the thing is I'm scared to death of hurting myself ( stupid I know 😂)because I haven't exercised like that in over 20 years and I've simply forgot how.\n\nWith my schedule I don't have someone to spot me on a regular basis, and while I watched some videos I'm always afraid my form will be bad and lead to injury.\n\nWhat can I do in my situation?\n",
    "url": "https://www.reddit.com/r/beginnerfitness/comments/1lzkqc8/fear_of_injury_keeping_me_from_exercising/",
    "created_utc": 1752495101.0,
    "author": "Whynotwg15",
    "subreddit": "beginnerfitness"
  },
  {
    "id": "1lzke0e",
    "title": "30 hours fasting did the magic",
    "selftext": "",
    "url": "https://i.redd.it/h8hnz0auqtcf1.jpeg",
    "created_utc": 1752494066.0,
    "author": "carlstewdave",
    "subreddit": "Biohackers"
  },
  {
    "id": "1lzcgtk",
    "title": "Cialis",
    "selftext": "Are you guys all doctor prescribed? Or does anyone use the online pharmacy such as “Blue Chew, Hims” all that internet doctor stuff? Anyone used those long term? ",
    "url": "https://www.reddit.com/r/Biohackers/comments/1lzcgtk/cialis/",
    "created_utc": 1752465131.0,
    "author": "Roaming_Alien",
    "subreddit": "Biohackers"
  },
  {
    "id": "1lzkpq6",
    "title": "Can't do a pullup but can do lat pulldowns heavier than body weight?",
    "selftext": "I don't know if it's my form on the pullups or if I need better grip strength but I'm only able to do one pullup with a jump assist and none without it. \n\nI've been doing assisted pullups for months, and I can do lat pulldowns machine +10kg my body weight (80+10) but when I try doing it it seems I just go a quarter up and completely die. I try wide grip and shoulder width but there seems to be no difference. \n\nI can do dead hangs for a minute, I can do 3 sets of 10 Australian pullups just fine but when it comes to proper pullups, and even negatives, I just go down immediately. What am I doing wrong? Is it just form?",
    "url": "https://www.reddit.com/r/bodyweightfitness/comments/1lzkpq6/cant_do_a_pullup_but_can_do_lat_pulldowns_heavier/",
    "created_utc": 1752495050.0,
    "author": "itsgaymonth",
    "subreddit": "bodyweightfitness"
  },
  {
    "id": "1lzkruw",
    "title": "Help Me Find Motivation Again",
    "selftext": "I have been strength training for 10 years. Very experienced at all the barbell lifts. Basically for the past decade I've successfully run strength and bodybuilding programs and been proud of my attention to strength training.\nI've struggled with diet and never really lost the fat. I'm not looking for advice there. Period. \nFor the past 6 months I've struggled with motivation. I've tried the following:\nMaking a 3 to 5 day a week routine with lifts I enjoy doing.\nMAPS (the one where you do 15 minutes a day)\n2 days a week of lifting plus 2 days a week of Barre\nTaking 2 weeks off\nWorking out at a different time of day (I work out early morning)\n\nI just dread going to lift. I have a nice home gym. Going to a gym or working with a trainer is not financially feasible, and getting a workout partner won't happen (I live rural).\n\nI am going thru menopause and have gained 15 lbs which is depressing. A lot of it is water retention that comes and goes. My diet hasn't changed, if anything I eat less from GLP 1s. My energy is decent. I've been walking 10k steps every day for the last month. My sleep is good. I have a lot of aches and pains here and there. Brain fog is awful. \n\nOn the diet side, I do my best to favor protein. I'm a minimum 90 to 100 grams a day and eat around 1500 calories a day. I try to get to 130 grams of protein a day. I eat good clean sources. And yes... I track. \n\nAny thoughts? I'm getting depressed. I know how good lifting is for me, and how much I used to LOVE it. I mean, I am a \"never skip a workout\" gal. But now, just ready to give it up and sit on the couch and get fat and weak. \n\nI would just love some ideas of how to get back to it and find that love again. ",
    "url": "https://www.reddit.com/r/fitness30plus/comments/1lzkruw/help_me_find_motivation_again/",
    "created_utc": 1752495227.0,
    "author": "Present-Tank-6476",
    "subreddit": "fitness30plus"
  },
  {
    "id": "1lzkkrp",
    "title": "Built my first “passive income snowball” starting with just €50 — here’s what actually worked (EU perspective)",
    "selftext": "I kept reading posts about “multiple income streams” but everything sounded either too expensive, too risky, or just… not possible if you’re starting with very little.\n\nSo I decided to try a different approach. I live in Europe, had maybe €50–100 I could spare, and instead of looking for the “big win,” I just focused on what I could control.\n\nHere’s what I actually did:\n\t•\tOpened a no-fee investment account that allowed fractional ETF shares\n\t•\tStarted with just €10 per week, fully automated\n\t•\tFocused on broad ETFs (nothing fancy, just global exposure)\n\t•\tUsed cashback apps, and every time I got €5–10 back → invested it\n\t•\tI tracked the results and created a weekly system that reminded me to review and reflect\n\nFast forward ~12 months:\nI’m not rich, but I’ve built a small portfolio (~€700), and more importantly, I now treat investing like brushing my teeth — it’s just part of life.\n\nIs this “passive income” in the traditional sense? Not really. But it feels passive because I barely think about it anymore, and I can see the compound effect starting to kick in.\n\nHappy to share more about the system or mindset if anyone’s curious.\nNot an expert, just someone who was tired of feeling like passive income was only for people with big money.\n",
    "url": "https://www.reddit.com/r/passive_income/comments/1lzkkrp/built_my_first_passive_income_snowball_starting/",
    "created_utc": 1752494635.0,
    "author": "Any-Whole3131",
    "subreddit": "passive_income"
  },
  {
    "id": "1lzkixj",
    "title": "“What’s Working for You in Passive Income in 2025?”",
    "selftext": "Curious about what’s working for people these days when it comes to passive income.\nWith so many options—real estate, affiliate marketing, digital products, SaaS, print-on-demand, YouTube automation, crypto staking, even AI-driven businesses—it's hard to know what's actually delivering results vs. what's just hype.\n\nSo, here’s what I’d love to hear from anyone willing to share:\n\nWhat’s your main passive (or semi-passive) income stream right now?\n\nHow long did it take before you saw meaningful returns?\n\nIf starting over today, what would you focus on?\n\n\nAlso curious about:\n\nStrategies that sounded good but totally flopped for you.\n\nHidden gems no one’s talking about.\n\n\n",
    "url": "https://www.reddit.com/r/passive_income/comments/1lzkixj/whats_working_for_you_in_passive_income_in_2025/",
    "created_utc": 1752494492.0,
    "author": "Fearless_Tree_1167",
    "subreddit": "passive_income"
  },
  {
    "id": "1lzkms8",
    "title": "Rookie Indecisiveness…HELP!",
    "selftext": "I’ve decided against dbol and I am considering, based upon the feedback I get, to instead use Primo or Mast or else if suggested the side effects of dbol is one you have now been convincing me too far negative for my taste based upon your guys wonderful feedback.",
    "url": "https://www.reddit.com/r/SteroidsWiki/comments/1lzkms8/rookie_indecisivenesshelp/",
    "created_utc": 1752494805.0,
    "author": "GutsandGains1990",
    "subreddit": "SteroidsWiki"
  },
  {
    "id": "1lx2yf0",
    "title": "Friday Fitness Thread",
    "selftext": "What sort of training are you doing?\n\nHow’s your training going? \n\nAre you running into any problems or have any questions the community might be able to help you out with?\n\nPost away!",
    "url": "https://www.reddit.com/r/StrongerByScience/comments/1lx2yf0/friday_fitness_thread/",
    "created_utc": 1752228075.0,
    "author": "AutoModerator",
    "subreddit": "StrongerByScience"
  },
  {
    "id": "1lxiln3",
    "title": "YouTuber Says Skull Crushers Will Destroy Your Elbows Over Time — Real Science or Just Fear-Mongering?",
    "selftext": "I recently came across a regional YouTuber who calls himself \"science-based\" and frequently cites biomechanics to explain proper exercise form. One of his bold claims is that skull crushers are a bad exercise and should be avoided entirely — even if you're not experiencing elbow pain now, he insists you eventually will.\n\nHe supports his argument by saying that skull crushers go against the natural movement pattern of the elbow. According to him, the elbow joint has an asymmetrical cylindrical shape, which means it’s meant to move in a diagonal plane. But no matter what equipment you use — whether it’s a barbell, EZ bar, or dumbbells — once the weight gets heavy, gravity forces your arms to move in a strict sagittal plane.\n\nHe claims this misalignment causes medial and lateral stress on the elbows, eventually leading to elbow-related issues.\n\nHow valid is this claim? Is this just another case of fear-mongering, or is there actually some solid biomechanical reasoning behind it?",
    "url": "https://www.reddit.com/r/StrongerByScience/comments/1lxiln3/youtuber_says_skull_crushers_will_destroy_your/",
    "created_utc": 1752268452.0,
    "author": "ILKOR22",
    "subreddit": "StrongerByScience"
  }
]